In [80]:
 # Dependencies and Setup
import pandas as pd

In [81]:
# File to Load 
file_to_load = "/Users/Grant/UCSD Bootcamp/Class Downloads/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

In [82]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [83]:
#Player Count
player_count=len(df["SN"].unique())
print(f"Total Players: {player_count}")

Total Players: 576

In [84]:
#Unique Items
unique_item_count=len(df["Item ID"].unique())
print(f"Number of Unique Items: {unique_item_count}")

Number of Unique Items: 183

In [85]:
#Average Price
average_price=df["Price"].mean()
average_price='${:,.2f}'.format(average_price)
print(f"Average Price: {average_price}")

Average Price: $3.05

In [86]:
#Number of Purchases
purchase_count=len(df)
print(f"Number of Purchase: {purchase_count}")

Number of Purchase: 780

In [87]:
#Total Revenue
total_revenue=sum(df["Price"])
total_revenue='${:,.2f}'.format(total_revenue)
print(f"Total Revenue: {total_revenue}")

Total Revenue: $2,379.77

In [88]:
#Summarize in Dataframe 
summary_df=pd.DataFrame({"Number of Unique Items":[unique_item_count],"Average Price":[average_price],
                         "Number of Purchases":[purchase_count],"Total Revenue":[total_revenue]},
                       columns=["Number of Unique Items","Average Price","Number of Purchases","Total Revenue"])
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

In [99]:
#Total unique male players (using nunique)
males=df.loc[(df["Gender"]=="Male")].nunique()
male_total=males['SN']
male_total

484

In [100]:
#Total unique female players (using len)
female_only=df.loc[(df["Gender"]=="Female")]
female_total=len(female_only["SN"].unique())
female_total

81

In [101]:
#Total unique other players
other_only=df.loc[(df["Gender"]=="Other / Non-Disclosed")]
other_total=len(other_only["SN"].unique())
other_total

11

In [102]:
#Summarize gender in dataframe
demographics_df=pd.DataFrame({"Total Count":[male_total, female_total, other_total],
                        "Percentage":[(male_total/player_count),(female_total/player_count),(other_total/player_count)]},
                       index=["Male","Female","Other / Non-Disclosed"],
                      columns=["Total Count","Percentage"])
demographics_df

                       Total Count  Percentage
Male                           484    0.840278
Female                          81    0.140625
Other / Non-Disclosed           11    0.019097

In [103]:
by_gender=df.groupby("Gender")

In [105]:
#Purchase Count by Gender
purchase_count_gender=by_gender['Purchase ID'].count()
purchase_count_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [106]:
#Average purchas price by Gender
avg_price_gender=by_gender['Price'].mean()
avg_price_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [107]:
#Total purchases by Gender
total_purchase_gender=by_gender['Price'].sum()
total_purchase_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [108]:
gender_purchase_df=pd.DataFrame({"Purchase Count":purchase_count_gender,
                                "Average Purchase Price":avg_price_gender,
                                 "Total Purchase Value":total_purchase_gender,
                                "Avg Total Purchase per Person":(total_purchase_gender/demographics_df['Total Count'])},
                                index=["Female","Male","Other / Non-Disclosed"],
                                columns=['Purchase Count','Average Purchase Price','Total Purchase Value','Avg Total Purchase per Person']
                               )
gender_purchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [109]:
bins=[0,9,14,19,24,29,34,39,150]
labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [110]:
df['Age Bracket']=pd.cut(df["Age"], bins, labels=labels)

In [111]:
age_group_purchases=df.groupby(['Age Bracket'])

In [112]:
age_group=age_group_purchases['SN'].nunique()
age_group

Age Bracket
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [113]:
age_group_df=pd.DataFrame({"Total Count":age_group,
                           "Percentage of Players":
                           (age_group/player_count)},
                         index=age_group.index,
                         columns=["Total Count","Percentage of Players"])
age_group_df

             Total Count  Percentage of Players
Age Bracket
<10                   17               0.029514
10-14                 22               0.038194
15-19                107               0.185764
20-24                258               0.447917
25-29                 77               0.133681
30-34                 52               0.090278
35-39                 31               0.053819
40+                   12               0.020833

In [114]:
purchase_count_age=age_group_purchases['Purchase ID'].count()
purchase_count_age

Age Bracket
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [115]:
avg_purchase_age=age_group_purchases['Price'].mean()
avg_purchase_age

Age Bracket
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [116]:
total_purchase_age=age_group_purchases['Price'].sum()
total_purchase_age

Age Bracket
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [117]:
age_purchase_df=pd.DataFrame({"Purchase Count":purchase_count_age,
                                "Average Purchase Price":avg_purchase_age,
                                 "Total Purchase Value":total_purchase_age,
                                "Avg Total Purchase per Person":(total_purchase_age/age_group_df['Total Count'])},
                                index=age_group.index,
                                columns=['Purchase Count','Average Purchase Price','Total Purchase Value','Avg Total Purchase per Person']
                               )
age_purchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Bracket,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [118]:
top_users_df=df.groupby('SN')['Price'].agg(['sum','count']).sort_values(by=['sum'], ascending=False)
top_users_df=top_users_df.rename(columns= {'sum':'Total Purchase Value','count':'Purchase Count'})

In [142]:
top_users_df['Average Purchase Price']=top_users_df['Total Purchase Value']/top_users_df["Purchase Count"]

In [143]:
top_users_df=top_users_df[['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']]
top_users_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [149]:
pop_items =df[['Item ID', 'Item Name', 'Price']]

In [189]:
pop_items_sum=pop_items.groupby(['Item ID','Item Name','Price'])['Price'].agg(['count','sum']).sort_values(by=['count'], ascending=False)

In [192]:
pop_items_sum=pop_items_sum.rename(columns={"count":"Purchase Count", "sum": "Total Purchase Value"})

pop_items_sum.head()

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
145,Fiery Glass Crusader,4.58,9,41.22
108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
82,Nirvana,4.90,9,44.10
19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16

In [194]:
profitable_items=pop_items_sum.sort_values(by=['Total Purchase Value'], ascending=False)

In [195]:
profitable_items.head()

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
82,Nirvana,4.90,9,44.10
145,Fiery Glass Crusader,4.58,9,41.22
92,Final Critic,4.88,8,39.04
103,Singed Scalpel,4.35,8,34.80